#include<iostream>
using namespace std;

int main(){
    //算術運算子(遵循先乘除，後加減)
    int A=5,B=2;
    printf("A=%d, B=%d\n",A,B);
    cout << "A+B= " << A+B <<'\n'; //加法 7
    cout << "A-B= " << A-B <<'\n'; //減法 3
    cout << "A*B= " << A*B <<'\n'; //乘法 10
    cout << "A/B= " << A/B <<'\n'; //除法 2(取商數)
    cout << "A%B= " << A%B <<'\n'; //餘除 1(取餘數)

    cout<<"=================="<<'\n';//分隔線

    //指定運算子(變數=值)
    int num1,num2,num3;
    num1 = 123; //變數=值
    cout << num1<<'\n'; //輸出:123
    num1 = num2 = num3 =100; //可以同時給多個變數賦值
    printf("%d %d %d\n",num1,num2,num3); //輸出:100 100 100

    num1 += num2; //等同於: num1 = num1 + num2;
    //除了+=，也有-=,*=,/=,%=，功能同理
    cout << num1 << '\n'; //輸出200

    cout<<"=================="<<'\n';//分隔線

    //關係運算子(比較兩個變數的關係)
    A=100;B=5;
    printf("A = %d, B = %d\n",A,B);
    cout << "A > B= " << (A>B) <<'\n'; //輸出:1 ，表示true，A大於B是對的
    cout << "A < B= " << (A<B) <<'\n'; //輸出:0 ，表示false，A小於B是錯的
    cout << "A >= B= " << (A>=B) <<'\n'; //輸出:1 ，表示true，A大於等於B是對的
    cout << "A <= B= " << (A<=B) <<'\n'; //輸出:0 ，表示false，A小於等於B是錯的
    cout << "A == B= " << (A==B) <<'\n'; //輸出:0 ，表示false，A等於B是錯的
    cout << "A != B= " << (A!=B) <<'\n'; //輸出:1 ，表示true，A不等於B是對的

    cout<<"=================="<<'\n';//分隔線

    //邏輯運算子
    printf("A = %d, B = %d\n",A,B);
    cout << "(A>B) && (A>99)= " << (A>B)&&(A>99); //&&也可以用and
    //&&(AND運算子)，當&&的兩側(A>B),(A>99)都為1(true)時，(A>B)&&(A>99)就會回傳1(true)
    //反之，若有任何一邊不是1(true)，則輸出0(false)
    cout << "\n(A>B) || (B==3)= " << (A>B) || (B==3); //||也可以用or
    //||(OR運算子)，當||的任一側為1(true)時，(A>B)||(B==3)就會回傳1(true)
    //反之，若兩側都是0(false)，則輸出0(false)
    cout << "\n!(A>B)= " << !(A>B) << '\n'; //!也可以用not
    //!(NOT運算子)，!後面的bool值會被顛倒，如!(A>B)，(A>B)=1(true)，加上!後會變成0(false)
    //(A>B)=1，!(A>B)=0 

    cout<<"=================="<<'\n';//分隔線

    //遞增/減運算子(a++,++a,a--,--a)
    int a=2,b,c=2,d;
    b = a++; //先b=a，再a=a+1
    cout << b <<'\n'; // 輸出:2

    d = ++c; //先c=c+1，再d=c
    cout << c <<'\n'; // 輸出:3

    int a1=2,b1,c1=2,d1;
    b1 = a1--; //先b1=a1，再a1=a1-1
    cout << b1 << '\n'; // 輸出:2

    d1 = --c1; //先c1=c1-1，再d1=c1
    cout << d1 << '\n'; // 輸出:1

    
}

//本篇筆記參考《徹底研究最新C++物件導向程式設計實例》3-1~3-14
//Create by B.J.Wang 2025/9/18