/*
題目說明:
給你一塊矩形土地的長寬，再依序給定每個機器人的初始位置狀況及一連串的指令集，
你必須用你的程式求出每個機器人最後的位置狀況。

一個機器人的位置狀況包括了其坐標（ x 坐標， y 坐標），
和它面向的方向（用 N , S , E , W 來分別代表北、南、東、西）。
至於一個機器人所收到的指令集，是一個由字母 ' L ' ， ' R ' ， 和 ' F ' 所構成的字串

其分別代表：

左轉（Left）：機器人在原地往左轉 90 度。
右轉（Right）: 機器人在原地往右轉 90 度。
前進（Forward）: 機器人往其面向的方向向前走一格，且不改變其面向之方向。
從坐標 (x,y) 走至 (x,y+1) 的這個方向我們定義為北方。

因為此矩形土地是有邊界的，所以一旦一個機器人走出邊界掉落下去，就相當於永遠消失了。
不過這個掉下去的機器人會留下「標記 ( scent ) 」，提醒以後的機器人，避免他們從同一個地方掉下去。
掉下去的機器人會把標記，留在他掉落之前所在的最後一個坐標點。
所以對於以後的機器人，當他正位在有標記的地方時，這個機器人就會忽略會讓他掉下去的指令。
*/

/*
輸入說明:
輸入裡的第一列有2個正整數，代表這個矩形世界右上角頂點的坐標，
其中假設這個世界的左下角頂點坐標為 ( 0 , 0 )。

接下來是若干組有關機器人的初始位置狀況和指令集，每個機器人2列。
第一列為位置狀況，包括了兩個整數和一個字元（ N , S , E 或 W ），代表機器人初始的位置坐標以及機器人最初所面對的方向。
第二列則是指令集，是一個由 ' L ' ， ' R ' 和 ' F ' 所組成的字串。輸入以 end-of-file 作為結束。

各機器人是依序動作的，也就是說，直到一個機器人作完他全部的動作，下一個機器人才會開始動作。

所有機器人的初始位置皆會在矩形土地上，不會落在外面。

任何坐標的最大值皆不會超過 50 。每個指令集的長度皆不會超過 100 個字元長。
*/

/*
輸出說明:
對於每一個機器人，你都必須輸出其最後所在的坐標和面對的方向。
如果一個機器人會掉落出此世界外，你必須先輸出他在掉落前，最後的所在位置和面對的方向，再多加一個字： LOST 。
*/


#include<iostream>
#include<map>
#include<string>
using namespace std;

int main(){
    ios_base::sync_with_stdio(0);
    cin.tie(0);

    int a[55][55]={0};  // 用於標記機器人是否掉落過，是(1) 否(0)
    bool lost = false;
    int UR_X, UR_Y; //  UR: upper-right
    char d;  // d:direction(以字元N,E,S,W表示)
    int D, X, Y, next_X, next_Y;
    // D: direction方向(以數字0,1,2,3表示)
    // X,y: 初始位置、機器人所處位置
    // next_X, nextY: 暫存機器人下一步的位置

    int move_X[4]={0,1,0,-1}, move_Y[4]={1,0,-1,0};
    // 對於N,E,S,W的每個朝向，前進一格後X,Y軸分別的變化量

    string s;  // 用於輸入機器人的行動

    // 方向, char to int
    map<char, int> CtoI = {
        {'N', 0},
        {'E', 1},
        {'S', 2},
        {'W', 3}
    };
    // 方向, int to char
    map<int, char> ItoC = {
        {0, 'N'},
        {1, 'E'},
        {2, 'S'},
        {3, 'W'}
    };

    cin >> UR_X >> UR_Y;
    while (cin >> X >> Y >> d >> s){
        lost = false;
        D = CtoI[d];
        for (int i=0; i<s.size(); ++i){
            // 三種動作: F(向當前朝向前進一格), L(左轉90度), R(右轉90度)
            if (s[i]=='F'){
                next_X = X + move_X[D];
                next_Y = Y + move_Y[D];

                // 判斷next_X,next_Y是否在邊界內
                if (next_X>=0 && next_X<=UR_X && next_Y>=0 && next_Y<=UR_Y){
                    X = next_X;
                    Y = next_Y;
                }
                else{  // 下一步會出界
                    // 兩種狀況: a[X][Y]==1(有標記過，continue) 
                    //          a[X][Y]==0(沒標記過，結算)
                    if (a[X][Y]==1) continue;
                    else{
                        // 結算
                        lost = true;
                        a[X][Y] = 1;
                        cout<< X << ' ' << Y << ' ' << d << " LOST\n";
                        break;
                    }
                }
            }
            else if (s[i]=='L'){
                D = (D -1 +4)%4;
                d = ItoC[D];
            }
            else if (s[i]=='R'){
                D = (D+1)%4;
                d = ItoC[D];
            }
        }
        if (!lost){
            cout << X << ' ' << Y << ' ' << d <<'\n';
        }
    }
    return 0;
}

// 本篇筆記參考 https://yuihuang.com/zj-c082/
// AC